# ContainsType Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectShapeLibrary..::..ContainsType Method
DirectShapeLibrary Class See Also
---
A quick check whether a definition type already exists in the library. Checks for type objects only.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool ContainsType(
	string name
)
```

Visual Basic
---
```text
Public Function ContainsType ( _
	name As String _
) As Boolean
```

Visual C++
---
```text
public:
bool ContainsType(
	String^ name
)
```

# ### Parameters
name
    Type: System..::..String Definition id
# ### Return Value
True if a geometry definition exists, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DirectShapeLibrary Class
Autodesk.Revit.DB Namespace